smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
/******************************************************************************
**                                                                           **
** Copyright (C) Infineon Technologies (2013)                                **
**                                                                           **
** All rights reserved.                                                      **
**                                                                           **
** This document contains proprietary information belonging to Infineon      **
** Technologies. Passing on and copying of this document, and communication  **
** of its contents is not permitted without prior written authorization.     **
**                                                                           **
*******************************************************************************
**                                                                           **
**  $FILENAME   : FlsLoader.c $                                              **
**                                                                           **
**  $CC VERSION : \main\95 $                                                 **
**                                                                           **
**  $DATE       : 2015-08-04 $                                               **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **
**  VENDOR      : Infineon Technologies                                      **
**                                                                           **
**  DESCRIPTION : This file contains                                         **
**                functionality of Flsloader driver.                         **
**                                                                           **
**  MAY BE CHANGED BY USER [yes/no]: No                                      **
**                                                                           **
******************************************************************************/
/*******************************************************************************
**                                                                            **
TRACEABILITY : [cover parentID=DS_NAS_FLSLOADER_PR647,
DS_NAS_FLSLOADER_PR127,DS_NAS_FLSLOADER_PR647,
DS_NAS_FLSLOADER_PR123,DS_NAS_FLSLOADER_PR759_PR760_PR761,
DS_NAS_FLSLOADER_PR1597_PR1598_PR1599_PR1600_PR1686_PR1687_PR1761_PR1762,
DS_NAS_FLSLOADER_PR1604_PR1605_PR1606_PR1607_PR1688_PR1689_PR1763_PR1764,
DS_NAS_FLSLOADER_PR637,DS_NAS_FLSLOADER_PR638,DS_NAS_FLSLOADER_PR639,
SAS_NAS_ALL_PR630_PR631,DS_NAS_FLSLOADER_PR115,DS_NAS_FLSLOADER_PR2986]
[/cover]
**                                                                            **
*******************************************************************************/

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/

  /* Inclusion of Tasking sfr file */
#include "IfxFlash_reg.h"

#include "IfxSrc_reg.h"

  /* Inclusion of Mcal Specific Global Header File */
#include "Mcal.h"

  /* Inclusion of Flash header file */
#include "FlsLoader.h"

  /* Inclusion of Flash header file */
#include "FlsLoader_Local.h"

#include "IfxCpu_reg.h"

#include "IfxScu_reg.h"

/*******************************************************************************
**                      Imported Compiler Switch Check                        **
*******************************************************************************/
#ifndef FLSLOADER_SW_MAJOR_VERSION
  #error "FLSLOADER_SW_MAJOR_VERSION is not defined. "
#endif

#ifndef FLSLOADER_SW_MINOR_VERSION
  #error "FLSLOADER_SW_MINOR_VERSION is not defined. "
#endif

#ifndef FLSLOADER_SW_PATCH_VERSION
  #error "FLSLOADER_SW_PATCH_VERSION is not defined. "
#endif

#if ( FLSLOADER_SW_MAJOR_VERSION != 2U )
  #error "FLSLOADER_SW_MAJOR_VERSION does not match. "
#endif

#if ( FLSLOADER_SW_MINOR_VERSION != 2U )
  #error "FLSLOADER_SW_MINOR_VERSION does not match. "
#endif

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/
  /* To differentiate between PFLASH and DFLASH the following value is written
  in the command cycle. */
#define FLSLOADER_PFLASH_VAL            ((FlsLoader_AddressType)(0x00000050U))

  /* The flash bank are assigned with values with respect to location in
  FLASH_FLASH0_FSR register. */

#define FLSLOADER_PROG_MASK             ((uint32)(0x00000080U))
#define FLSLOADER_ERASE_MASK            ((uint32)(0x00000100U))
  /*The following to macros are used to determine the status of Flash. */
#define FLSLOADER_NORMAL                (0U)
#define FLSLOADER_SUSPEND               (1U)
#define FLSLOADER_UNINTIALIZED          (0U)

  /* Flash NULL */
#define FLSLOADER_NULL                  ((void *) 0)
#define FLSLOADER_ZERO_DATA             (0x00000000U)
#define FLSLOADER_PFLASH_ADDRESS_MASK   ((FlsLoader_AddressType)(0x00FFFFFFU))
#define FLSLOADER_ADDRESS_HI_5_MASK     ((FlsLoader_AddressType)(0x000FFFFFU))
#define FLSLOADER_SHIFT_BY_16           (16U)
#define FLSLOADER_SHIFT_BY_8            (8U)
#define FLSLOADER_SHIFT_BY_15           (15U)
#define FLSLOADER_NUM_5                 (5U)
#define FLSLOADER_NUM_32                (32U)
#define FLSLOADER_NUM_256               (256U)
#define FLSLOADER_NUM_8                 (8U)
#define FLSLOADER_UCB0                  (0U)
#define FLSLOADER_UCB1                  (1U)
#define FLSLOADER_PWD                   (8U)
#define FLSLOADER_NUM_3                 (3U)
  /* (17*8)bytes UCB <P/D>FLASH content */
#define FLSLOADER_FLASH_TRAP_DIS        (0x00008000U)
#define FLSLOADER_FLASH_TRAP_EN         (0xFFFF7FFFU)

  /* Program Verify Error */
#define FLSLOADER_PVER_ERROR                  (0x02000000U)
  /* Erase Verify Error */
#define FLSLOADER_EVER_ERROR                  (0x04000000U)

  /* Flash command should point this Address */
#define FLSLOADER_CMD_BASE  ((FlsLoader_AddressType)(0xAF000000U))

#define FLASH_HW_MODULE ((volatile Ifx_FLASH *)(void *) &(MODULE_FLASH0))
#define FLASH0_PROCONP ((volatile Ifx_FLASH_PROCONP*)(void *)(&FLASH0_PROCONP0))
#define FLASH0_PROCONOTP \
         ((volatile Ifx_FLASH_PROCONOTP*)(void *)(&FLASH0_PROCONOTP0))
#define FLASH0_PROCONWOP \
         ((volatile Ifx_FLASH_PROCONWOP*)(void *)(&FLASH0_PROCONWOP0))



