smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
#define FLSLOADER_WDT_PASSWORD_LOWER_MASK  ( 0x000000FCu )

  /* mask for password Bits 8-15 */
#define FLSLOADER_WDT_PASSWORD_UPPER_MASK  ( 0x0000FF00u )

  /* mask for password bits */
#define FLSLOADER_WDT_PASSWORD_MASK   \
                                    (FLSLOADER_WDT_PASSWORD_LOWER_MASK | \
                                     FLSLOADER_WDT_PASSWORD_UPPER_MASK)

#define FLSLOADER_WDT_RELOAD_MASK          ( 0xFFFF0000u )


  /* mask for LCK and ENDINIT status bits */
#define FLSLOADER_WDT_STATUS_MASK          ( 0x00000003u )


/*******************************************************************************
**                      Private function like Macros                          **
*******************************************************************************/

  /*
  Function Like Macro:FlsLoader_lGetMode
  macro to get the kind of flash
  Input Parameters: FlashType
  */
  /*IFX_MISRA_RULE_19_07_STATUS=Function like macro used for code simplication 
  and readability*/
#define FlsLoader_lGetMode(FlashType) (((FlashType)!=(FLSLOADER_DFLASH_BANK0)) \
                             ? (FLSLOADER_PFLASH_VAL) : (FLSLOADER_DFLASH_VAL))

/******************************************************************************
**                      Global Type Definitions                              **
******************************************************************************/
/******************************************************************************
**                      Private Type Definitions                             **
******************************************************************************/

/*******************************************************************************
**                      Private Constant Definitions                          **
*******************************************************************************/

/******************************************************************************
**                      Private Variable Definitions                         **
******************************************************************************/

#ifdef IFX_FLSLOADER_DEBUG
#define FLSLOADER_START_SEC_VAR_32BIT
#include "MemMap.h"
    extern volatile uint32 TestFlsloader_DebugMask01;
    extern volatile uint32 TestFlsloader_DebugMask02;
    extern volatile uint32 TestFlsloader_DebugMask04;
    extern volatile uint32 TestFlsloader_DebugMask05;
    extern volatile uint32 TestFlsloader_DebugMask06;
    extern volatile uint32 TestFlsloader_DebugMask07;
    extern volatile uint32 TestFlsloader_DebugMask09;
    
#define FLSLOADER_STOP_SEC_VAR_32BIT
#include "MemMap.h"
#endif

#define FLSLOADER_START_SEC_VAR_8BIT
#include "MemMap.h"
  static uint8 FlsLoader_Status;
#if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  uint8  FlsLoader_InitStatus;
#endif
#define FLSLOADER_STOP_SEC_VAR_8BIT
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor 
  directives is allowed only for MemMap.h*/
#include "MemMap.h"

#define FLSLOADER_START_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor 
  directives is allowed only for MemMap.h*/
#include "MemMap.h"
/*******************************************************************************
**                    Prototypes Of Local Functions                           **
*******************************************************************************/
  /* funtion to check program verification error */
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lPverCheck(void);

  /* funtion to check Erase verification error */
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lEverCheck(void);

IFX_LOCAL_INLINE void FlsLoader_lResetSafetyENDINIT(void);

IFX_LOCAL_INLINE void FlsLoader_lSetSafetyENDINIT(void);


IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lBurstWrite (
                            uint32 BurstLoadPageCount,
                            FlsLoader_AddressType BurstOffSet,
                            uint32 FlashType,
                            const uint8 *SourceAddressPtr,
                            FlsLoader_AddressType TargetAddress,
                            uint32 NumberOfBursts);

IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lPageWrite (
                           uint32 LoadPageCount,
                           FlsLoader_AddressType OffSet,
                           uint32 FlashType,
                           const uint8 *SourceAddressPtr,
                           FlsLoader_AddressType TargetAddress,
                           uint32 NoOfPages);

#define FLSLOADER_STOP_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor 
  directives is allowed only for MemMap.h*/
#include "MemMap.h"
/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/

/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/

/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/
  /* Mapping the code */
#define FLSLOADER_START_SEC_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor 
  directives is allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_FLSLOADER_PR1623]                    **
**            [/cover]                                                        **
** Syntax           :  FlsLoader_ReturnType FlsLoader_Init(                   **
**                      const FlsLoader_ConfigType* Address)                  **
**                                                                            **
** Service ID       : 0x00                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : Address :NULL Expected                                  **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType:(If DET is not enabled)            **
**                    1.FLSLOADER_E_OK                                        **
**                    2.FLSLOADER_E_ROMVERSION                                **
**                    1.FLSLOADER_E_NOT_OK                                    **
**                                                                            **
** Description      : This function initilizes the flash module and checks    **
**                    if all the flash sectors is configured as ROM           **
**                                                                            **
*******************************************************************************/
/*
CD_FlsLoader028: This is the initialization function for FlsLoader.
*/
FlsLoader_ReturnType FlsLoader_Init(const FlsLoader_ConfigType* Address)
{
  FlsLoader_ReturnType  RetError;
  UNUSED_PARAMETER(Address)

  /* Init RetError to OK */
  #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  RetError = FLSLOADER_E_OK; 
  #endif
  /*
  Check if Passed Address is NULL
  */

  #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  if ( Address != FLSLOADER_NULL )
  {
    /* Report FLSLOADER_E_PARAM_IGNORED DET */
    Det_ReportError(
                    FLSLOADER_MODULE_ID,
                    FLSLOADER_INSTANCE_ID,
                    FLSLOADER_SID_INIT,
                    FLSLOADER_E_PARAM_IGNORED);
  
    RetError = FLSLOADER_E_NOT_OK;
  }
  if (RetError != FLSLOADER_E_NOT_OK)
  #endif
  {
    RetError = FlsLoader_lCheckOTPWOP();
    /*FLASH_FCON register will be initialized in the start up. */
    FlsLoader_Status = FLSLOADER_NORMAL;
    #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
    FlsLoader_InitStatus = FLSLOADER_INITIALIZED;
    #endif
    Mcal_ResetENDINIT();
    /* Disable traps on Uncorrectable errors */
    FLASH0_MARP.U |= FLSLOADER_FLASH_TRAP_DIS;
    /* Set End Init Protection */
    Mcal_SetENDINIT();
    /* Disable traps on Uncorrectable errors */
    FLASH0_MARD.U |= FLSLOADER_FLASH_TRAP_DIS;
  }
  return (RetError);
}  /*End of Fls_Loader_Init */

