smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
  /*Preprocessor switch to enable/disable the API to deinitialze
  FlsLoader. */
#if (FLSLOADER_DEINIT_API == STD_ON)
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_FLSLOADER_PR1624]                    **

** Syntax           :  FlsLoader_ReturnType FlsLoader_DeInit(void)            **
**            [/cover]                                                        **
** Service ID       : 0x01                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : void                                                    **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType:(If DET is not enabled)            **
**                    1. FLSLOADER_E_OK                                       **
**                    2. FLSLOADER_E_BUSY                                     **
**                    1.FLSLOADER_E_BUSY                                      **
**                                                                            **
** Description      : This function deinitilizes the flash module.            **
**                    This Function sets the registers to their default       **
**                    state and executes the reset to read command.           **
**                                                                            **
*******************************************************************************/
  /*
  CD_FlsLoader030: Service for FlsLaderDeInitialization
  */
FlsLoader_ReturnType FlsLoader_DeInit(void)
{
  FlsLoader_ReturnType  RetError;
  uint32 Fls0FsrCheck;
  /* Init RetError to OK */
  RetError = FLSLOADER_E_OK;

  #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  if (FlsLoader_InitStatus != FLSLOADER_INITIALIZED)
  {
    /* CD_FlsLoader032: FlsLoader not initialized,Report to DET*/
    Det_ReportError (
                      FLSLOADER_MODULE_ID,
                      FLSLOADER_INSTANCE_ID,
                      FLSLOADER_SID_DEINIT,
                      FLSLOADER_E_UNINIT);
    RetError = FLSLOADER_E_NOT_OK;
  }
  if (RetError != FLSLOADER_E_NOT_OK )
  #endif
  {
    /* Check for Flash Busy*/
    #ifdef IFX_FLSLOADER_DEBUG
    Fls0FsrCheck = ((FLASH0_FSR.U & ((uint32)FLSLOADER_FLASH_BUSY_MASK)) |
                     TestFlsloader_DebugMask01);
    #else  /*#ifdef IFX_FLSLOADER_DEBUG*/
    Fls0FsrCheck = (FLASH0_FSR.U & (uint32)(FLSLOADER_FLASH_BUSY_MASK));
    #endif  /*#ifdef IFX_FLSLOADER_DEBUG*/
    if (Fls0FsrCheck)
    {
      /* Report FLSLOADER_E_BUSY DET */
      RetError = FLSLOADER_E_BUSY;
      #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
      Det_ReportError (
                      FLSLOADER_MODULE_ID,
                      FLSLOADER_INSTANCE_ID,
                      FLSLOADER_SID_DEINIT,
                      (uint8)FLSLOADER_E_BUSY);
      #endif
    }
    else
    {
      FlsLoader_Status = FLSLOADER_NORMAL;
      #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
      FlsLoader_InitStatus = FLSLOADER_UNINTIALIZED;
      #endif
      /* Reset to Read PFLASH, DFLASH (both banks) */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
      volatile uint32 to avoid compiler optimization in command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
      address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
      address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FlsLoader_lResetRead
      (FLSLOADER_DFLASH0_START_ADDRESS)) = FLSLOADER_VALUE_F0;
    }
    /* Reset EndInit protection */
    Mcal_ResetENDINIT();
    /* Enable traps on Uncorrectable errors */
    FLASH0_MARP.U &= FLSLOADER_FLASH_TRAP_EN;
    /* Set End Init Protection */
    Mcal_SetENDINIT();
    /* Enable traps on Uncorrectable errors */
    FLASH0_MARD.U &= FLSLOADER_FLASH_TRAP_EN; 
  }
  return (RetError);
}  /*End of function FlsLoader_DeInit */
#endif  /*(FLSLOADER_DEINIT_API == STD_ON) */
#define FLSLOADER_STOP_SEC_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor 
  directives is allowed only for MemMap.h*/
#include "MemMap.h"

#define FLSLOADER_START_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor 
  directives is allowed only for MemMap.h*/
#include "MemMap.h"
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_FLSLOADER_PR1625]                    **
**            [/cover]                                                        **
** Syntax           :  FlsLoader_ReturnType FlsLoader_Write(                  **
**                      FlsLoader_AddressType TargetAddress,                  **
**                      FlsLoader_LengthType Length,                          **
**                      const uint8 *SourceAddressPtr                         **
**                    )                                                       **
**                                                                            **
** Service ID       : 0x02                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : Address:Source data Address                             **
**                    Length :Length of the data in bytes                     **
**                    - multiple of 256 bytes(8 pages)for PFLASH              **
**                    - multiple of 32 bytes (4 pages)for DFLASH              **
**                    TargetAddress :Destination Address in Flash             **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType                                    **
**                    1.FLSLOADER_E_OK                                        **
**                    2.FLSLOADER_E_BUSY                                      **
**                    3.FLSLOADER_E_NOT_OK                                    **
**                    4.FLSLOADER_E_LOCKED                                    **
**                                                                            **
**                    1.FLSLOADER_E_NOT_OK for all errors                     **
**                                                                            **
** Description      : This function is used to program a page of internal     **
**                    flash using Burst mode of programming                   **
**                    This function does not check whether the TargetAddress  **
**                    crosses the boundry from one sector to another          **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_Write(FlsLoader_AddressType TargetAddress,
                                     FlsLoader_LengthType Length,
                                     const uint8 *SourceAddressPtr)
{
  FlsLoader_ReturnType  RetError;
  FlsLoader_AddressType OffSet;
  FlsLoader_AddressType BurstOffSet;
  uint32                FlashType;
  uint32                NumberOfBursts;
  uint32                FlsFsrCheck;
  uint32                Icr;
  uint32                BytesToWrite;
  uint32                NoOfPages;
  uint32                LoadPageCount;
  uint32                BurstLoadPageCount;


  /*Block 1: DET Check */
  #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  RetError = FlsLoader_lWriteDetCheck(Length,TargetAddress);

  if (RetError != FLSLOADER_E_NOT_OK)
  #endif
  {
    #ifdef IFX_FLSLOADER_DEBUG
    FlsFsrCheck = ((FLASH0_FSR.U & ((uint32)FLSLOADER_FLASH_BUSY_MASK)) |
                    TestFlsloader_DebugMask01);
    #else  /*#ifdef IFX_FLSLOADER_DEBUG*/
    /*Check for Busy state of FLASH
    Registers differ between Checking of Busy state of PFlash and DFlash */
    FlsFsrCheck = (FLASH0_FSR.U & ((uint32)FLSLOADER_FLASH_BUSY_MASK));
    #endif  /*#ifdef IFX_FLSLOADER_DEBUG*/
    if ( FlsFsrCheck )
    {
      /* Report FLSLOADER_E_BUSY DET */
      #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
      Det_ReportError(
                    FLSLOADER_MODULE_ID,
                    FLSLOADER_INSTANCE_ID,
                    FLSLOADER_SID_WRITE,
                    (uint8)FLSLOADER_E_BUSY);
      #endif
      RetError = FLSLOADER_E_BUSY;
    }
    else if ( SourceAddressPtr == FLSLOADER_NULL)
    {
      RetError = FLSLOADER_E_NOT_OK;
    }
    else
    { 
      /*PFLASH0*/
      /* Block 2: check the Flash Type DFLASH/PFLASH .
      If the Flash type is PFLASH check PMU0. */
      FlashType = FlsLoader_lGetFlashType (TargetAddress);
      /* Protection Installation check  */
      /* Preprocessor switch to enable/disable the lockcheck functionality */
      /*#if (FLSLOADER_ENABLE_LOCKCHECK == STD_ON)*/
      #if (FLSLOADER_ENABLE_LOCKCHECK == STD_ON)
      RetError = FlsLoader_lFlashLockCheck(TargetAddress,FlashType,Length);
      if (FLSLOADER_E_OK == RetError)
      #endif
      {
        /* Count the number of loops */
        if (FlashType != FLSLOADER_DFLASH_BANK0)
        {
          NumberOfBursts  = Length >> FLSLOADER_SHIFT_BY_8; /* Divide by 256 */
          LoadPageCount  = FLSLOADER_NUM_4;
          BurstLoadPageCount = FLSLOADER_NUM_32;
          OffSet       = (FlsLoader_AddressType)FLSLOADER_NUM_32;
          BurstOffSet  = (FlsLoader_AddressType)FLSLOADER_NUM_256;
          BytesToWrite = (Length - (NumberOfBursts * FLSLOADER_NUM_256));
          NoOfPages    = (BytesToWrite / FLSLOADER_NUM_32);
        }
        else
        {
          NumberOfBursts  = Length >> FLSLOADER_NUM_5; /* Divide by 32 */
          LoadPageCount      = 1U;
          BurstLoadPageCount = FLSLOADER_NUM_4;
          OffSet       = (FlsLoader_AddressType)FLSLOADER_NUM_8;
          BurstOffSet  = (FlsLoader_AddressType)FLSLOADER_NUM_32;
          BytesToWrite = (Length - (NumberOfBursts * FLSLOADER_NUM_32));
          NoOfPages    = (BytesToWrite / FLSLOADER_NUM_8);
        }
      
