smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
        /* Block 5: Execute the command sequence . */
        /*Initiating the state to normal*/
        FlsLoader_Status = FLSLOADER_NORMAL; 
        /* Disable and restore interrupts for critical
        command cycles. As there are 2 critical command cycles, 
        the entire write operation is protected. */
        /* copy the Address to local variable*/
        Icr = FlsLoader_lDisableInts();
        
        /*Write in Burst Mode*/
        RetError = FlsLoader_lBurstWrite (BurstLoadPageCount,BurstOffSet,
                                          FlashType,SourceAddressPtr,
                                          TargetAddress,NumberOfBursts);
        
        if ((RetError == FLSLOADER_E_OK) && (NoOfPages != 0U))
        {
          /* Write Remaining Pages */
          TargetAddress += NumberOfBursts * 
                          (BurstLoadPageCount << FLSLOADER_NUM_3);
          /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to access
          user buffer efficiently*/
          SourceAddressPtr += NumberOfBursts * 
                          (BurstLoadPageCount << FLSLOADER_NUM_3);
          RetError = FlsLoader_lPageWrite (LoadPageCount,
                                           OffSet,FlashType,SourceAddressPtr,
                                           TargetAddress,NoOfPages);
        }
        FlsLoader_lEnableInts(Icr);
      }
    }
  }
  return (RetError);
}  /*End of function OCFLS_Write */
#define FLSLOADER_STOP_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives 
  is allowed only for MemMap.h*/
#include "MemMap.h"

#define FLSLOADER_START_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives 
  is allowed only for MemMap.h*/
#include "MemMap.h"
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_FLSLOADER_PR1626]                    **
**            [/cover]                                                        **
** Syntax           :  FlsLoader_ReturnType FlsLoader_Erase(                  **
**                      FlsLoader_AddressType TargetAddress,                  **
**                      FlsLoader_LengthType Length                           **
**                    )                                                       **
**                                                                            **
** Service ID       : 0x03                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : Length - Number of sectors                              **
**                    TargetAddress - Starting Address of the sector          **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     :  FlsLoader_ReturnType(DET is not enabled)               **
**                     1.FLSLOADER_E_OK                                       **
**                     2.FLSLOADER_E_BUSY                                     **
**                     4.FLSLOADER_E_LOCKED                                   **
**                                                                            **
**                     1.FLSLOADER_E_NOT_OK for all errors but for busy.      **
**                       For busy state FLSLOADER_E_BUSY is returned          **
**                                                                            **
** Description      : This function erases the sector of the internal flash.  **
*******************************************************************************/
/* Service to Erase a sector of Flash */
FlsLoader_ReturnType FlsLoader_Erase(FlsLoader_AddressType TargetAddress,
                                     FlsLoader_LengthType Length )
{
  FlsLoader_ReturnType  RetError;
  FlsLoader_AddressType StartAddress;
  uint32                FlsFsrCheck;
  uint32                FlsFSRErase;
  volatile uint32       BusyCheck;
  uint32                InnerCount;
  uint32                Icr;
  uint32                FlashType;

  /*Init RetError to OK */
  /*RetError = (FlsLoader_ReturnType)FLSLOADER_E_OK;*/

  /*Block 1: check DET */
  #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  RetError = FlsLoader_lEraseDetCheck(Length,TargetAddress);

  if (RetError == FLSLOADER_E_OK)
  #endif
  {
    #ifdef IFX_FLSLOADER_DEBUG
    FlsFsrCheck = ((FLASH0_FSR.U & ((uint32)FLSLOADER_FLASH_BUSY_MASK)) |
                      TestFlsloader_DebugMask01);
    #else  /*#ifdef IFX_FLSLOADER_DEBUG*/
    /* Check for Busy state of FLASH
    Registers differ between Checking of Busy state of PFlash and DFlash */
    FlsFsrCheck = (FLASH0_FSR.U & ((uint32)FLSLOADER_FLASH_BUSY_MASK));
    #endif  /*#ifdef IFX_FLSLOADER_DEBUG*/
    if ( FlsFsrCheck )
    {
      /* Report FLSLOADER_E_BUSY DET */
      #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
      Det_ReportError(
                     FLSLOADER_MODULE_ID,
                     FLSLOADER_INSTANCE_ID,
                     FLSLOADER_SID_ERASE,
              (uint8)FLSLOADER_E_BUSY);
      #endif
      RetError = FLSLOADER_E_BUSY;
    }
    else
    {
      /* Extract the flash type */
      FlashType = FlsLoader_lGetFlashType (TargetAddress);

      /* Given Address belongs to Data FLASH */
      /*Check if the Target Address passed is UCB protected */
      /* Check if global write protection is installed in DFLASH*/
      /*Check if the Target Address passed is UCB protected */
      #if (FLSLOADER_ENABLE_LOCKCHECK == STD_ON)
      /* Protection Check Algorithm */
      /* Preprocessor switch to enable/disable the lockcheck functionality */
      /* Check if global write protection is installed */
      RetError = FlsLoader_lEraseLockCheck (TargetAddress,FlashType,Length);

      if (RetError == FLSLOADER_E_OK)
      #endif
      {
        StartAddress = FLSLOADER_CMD_BASE;
        Icr = FlsLoader_lDisableInts();
        if (FlashType != FLSLOADER_DFLASH_BANK0)
        {
          FlsLoader_lResetSafetyENDINIT();
        }
        DSYNC();
        FlsLoader_Status = FLSLOADER_NORMAL; /* Initiating the state to normal*/
        #ifndef IFX_FLSLOADER_DEBUG
        /* Safety Reset Endinit is required for PFlash */
        /* Enter Critical Section */
        /* cycle 1 */
        /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
        volatile uint32 to avoid compiler optimization in command cycles*/
        /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AA50(StartAddress))  = 
                                                                  TargetAddress;
        /* cycle 2 */
        /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
        volatile uint32 to avoid compiler optimization in command cycles*/
        /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AA58(StartAddress))  = 
                                                                   Length;
        /* cycle 3 */
        /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
        volatile uint32 to avoid compiler optimization in command cycles*/
        /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AAA8(StartAddress))  = 
                                                             FLSLOADER_VALUE_80;
        /* cycle 4 */
        /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
        volatile uint32 to avoid compiler optimization in command cycles*/
        /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AAA8(StartAddress))  = 
                                                             FLSLOADER_VALUE_50;
        #endif
        /* Exit Critical Section */
        if (FlashType != FLSLOADER_DFLASH_BANK0)
        {
          FlsLoader_lSetSafetyENDINIT();
        }
        DSYNC();

        InnerCount = 0U;
        #ifdef  IFX_FLSLOADER_DEBUG
        FlsFSRErase =  TestFlsloader_DebugMask06;
        #else
        FlsFSRErase = FLASH0_FSR.B.ERASE;
        #endif

