smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
        while((FlsFSRErase != FLSLOADER_BIT_SET) &&
              (InnerCount < FLSLOADER_CMDCYCLE_TIMEOUT))
        {
          InnerCount++;
          #ifdef  IFX_FLSLOADER_DEBUG
          FlsFSRErase =  TestFlsloader_DebugMask06;
          #else
          FlsFSRErase = FLASH0_FSR.B.ERASE;
          #endif   
        }
        
        if(InnerCount < FLSLOADER_CMDCYCLE_TIMEOUT)
        {
          /* Check for FLASH BUSY flag */
          /* PnBUSY and D0BUSY */
          InnerCount = 0U;
          #ifdef  IFX_FLSLOADER_DEBUG
          BusyCheck = TestFlsloader_DebugMask02;
          #else
          BusyCheck = (FLASH0_FSR.U & (uint32)FLSLOADER_FLASH_BUSY_MASK);
          #endif
          while (( BusyCheck != 0U) &&
                 ( InnerCount < FLSLOADER_BUSY_TIMEOUT))
          {
            InnerCount++;
            #ifdef  IFX_FLSLOADER_DEBUG
            BusyCheck = TestFlsloader_DebugMask02;
            #else
            BusyCheck = (FLASH0_FSR.U & (uint32)FLSLOADER_FLASH_BUSY_MASK);
            #endif
          }
          if (InnerCount < FLSLOADER_BUSY_TIMEOUT )
          {
            /* This check makes sure No protection error and no sequence error
            and No operation error has occurred.*/
            RetError = FlsLoader_lProtSeqOperErrorCheck();
            if(RetError == FLSLOADER_E_OK)
            {
              /* This check makes sure No erase verification error */
              RetError = FlsLoader_lEverCheck();
            }
          }
          else
          {
            RetError = FLSLOADER_E_NOT_OK;
          }
        }
        else
        {
          RetError = FLSLOADER_E_NOT_OK;
        }
        /* Clear the status if the operation is successful.*/
        /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
        volatile uint32 to avoid compiler optimization in command cycles*/
        /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
        address comparison/calculation purpose.*/
        *((FlsLoader_AddressType*)FlsLoader_lClearStatus(StartAddress))
                          = FLSLOADER_VALUE_FA;
      
        FlsLoader_lEnableInts(Icr);
      }
    }
  }
  return(RetError);
}  /* End of Function */
#define FLSLOADER_STOP_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#define FLSLOADER_START_SEC_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

  /* Preprocessor switch to enable/disable the FlsLoader_Lock API */
#if (FLSLOADER_LOCK_UNLOCK_API == STD_ON)
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_FLSLOADER_PR1627]                    **
**            [/cover]                                                        **
** Syntax           :  FlsLoader_ReturnType FlsLoader_Lock(                   **
**                              void                                          **
**                                                                            **
**                           )                                                **
**                                                                            **
** Service ID       : 0x04                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : FlsLoader_AddressType TargetAddress,                    **
**                    FlsLoader_LengthType Length                             **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     :  FlsLoader_ReturnType:(DET is not enabled)              **
**                     1.FLSLOADER_E_OK                                       **
**                     2.FLSLOADER_E_BUSY                                     **
**                     3.FLSLOADER_E_LOCKED                                   **
**                     4.FLSLOADER_E_NOT_OK for all errors but for busy.      **
**                       For busy state FLSLOADER_E_BUSY is returned          **
**                                                                            **
** Description      : This function is used to  Apply the sector protection to**
**                    the internal  Flash of the microcontroller.             **
**                    If any sector is previously locked FLSLOADER_E_LOCKED   **
**                    is returned.                                            **
**                    No valid parameters are expected here.                  **
**                    This API cannot be suspended                            **
**                    Service to Lock the internal flash of the microcontroller.
**                    Locking is dependent on the parameters given and not the**
**                    passsed parameters.                                     **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_Lock(void)
{
  uint32                FlashBusy;
  FlsLoader_ReturnType  RetError ;
  uint32                FlsFpro;
  uint32                FlsFproinp;
  uint32                FlsFproind;
  uint32                FlsFproinotp;

  RetError = FLSLOADER_E_OK ;

  #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  if (FlsLoader_InitStatus != FLSLOADER_INITIALIZED)
  {
    /* Report missing initialization to DET */
    Det_ReportError(FLSLOADER_MODULE_ID,
                    FLSLOADER_INSTANCE_ID,
                    FLSLOADER_SID_LOCK,
                    FLSLOADER_E_UNINIT);
    RetError = FLSLOADER_E_NOT_OK;
  }
  #endif
  /* (FLSLOADER_DEV_ERROR_DETECT == STD_ON) */

