smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
  /* Check if PFLASH0/1 or DFLASH is busy */
  #ifdef IFX_FLSLOADER_DEBUG
  FlashBusy = TestFlsloader_DebugMask01;
  #else
  FlashBusy = (uint32)(FLASH0_FSR.U & FLSLOADER_FLASH_BUSY_MASK);
  #endif  /*#ifdef IFX_FLSLOADER_DEBUG*/
  if (FlashBusy != FLSLOADER_ZERO_DATA)
  {
    /* Report Flash Busy to DET */
    RetError = FLSLOADER_E_BUSY;
    #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
    Det_ReportError(
                  FLSLOADER_MODULE_ID,
                  FLSLOADER_INSTANCE_ID,
                  FLSLOADER_SID_LOCK,
           (uint8)FLSLOADER_E_BUSY);
    #endif
    /*(FLSLOADER_DEV_ERROR_DETECT == STD_ON)*/
  }
    /* Protection should not be installed for the corresponding user level.*/
  if (RetError == FLSLOADER_E_OK)
  {
    /* Check if read/write/OTP/WOP is installled in PFLASH or DFLASH */
    FlsFpro = FLASH0_FPRO.B.PRODISP;
    #ifdef  IFX_FLSLOADER_DEBUG
    FlsFproinp    = TestFlsloader_DebugMask07;
    FlsFproind    = TestFlsloader_DebugMask07;
    FlsFproinotp  = TestFlsloader_DebugMask07;
    #else
    FlsFproinp = FLASH0_FPRO.B.PROINP;
    FlsFproind = FLASH0_FPRO.B.PROIND;
    FlsFproinotp = FLASH0_FPRO.B.PROINOTP;
    #endif
    if(FlsFpro != 1U)
    {
      if(FlsFproinp == 1U)
      {
        RetError = FLSLOADER_E_LOCKED;
      }
      if(FlsFproind == 1U)
      {
        RetError = FLSLOADER_E_LOCKED;
      }
    }
    if(FlsFproinotp == 1U)
    {
      RetError = FLSLOADER_E_LOCKED;
    }
  }

  if (RetError == FLSLOADER_E_OK)
    {
      RetError = FlsLoader_lLock();
    }
  return (RetError);
}  /* End of function FlsLoader_Lock */
#endif  /*(FLSLOADER_LOCK_UNLOCK_API == STD_ON) */


#if (FLSLOADER_LOCK_UNLOCK_API == STD_ON)
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_FLSLOADER_PR1629]                    **
**            [/cover]                                                        **
** Syntax           :  FlsLoader_ReturnType FlsLoader_UnLock(                 **
**                       FlsLoader_AddressType TargetAddress,                 **
**                       FlsLoader_ValueType* Password                        **
**                                                                            **
**                    )                                                       **
**                                                                            **
** Service ID       : 0x05                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   :                                                         **
**                    Password: pointer to the 4 double word(256 bit)         **
**                               Password for UCB protection                  **
**                    TargetAddress: Target address of user config block.     **
**                    Possible values are 0xAF100000, 0xAF100400.             **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : FlsLoader_ReturnType:(DET is not enabled)               **
**                    1.FLSLOADER_E_OK                                        **
**                    2.FLSLOADER_E_BUSY                                      **
**                    3.FLSLOADER_E_NOT_OK                                    **
**                                                                            **
** Description      : This function is used to  unlock(protect) the protection
                      in                                PFLASH and DFLASH     **
                      protection.                                             **
**                    A wrong password will result in Protection Error        **
**                    This API needs to be called twice if the user needs to  **
**                    unlock both PFLASH and DFLASH protection                **
**                    This API cannot be suspended                            **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_UnLock(
                                    FlsLoader_AddressType TargetAddress,
                                    FlsLoader_ValueType* Password
                                    )
{
  FlsLoader_ReturnType   RetError ;
  FlsLoader_AddressType  StartAddress;
  uint32                 FlsErrCheck;
  volatile uint32        FlsBusyStat;
  volatile uint32        FlsFpro;
  volatile uint32        FlsFprodisd;
  volatile uint8         UserConfig;
  volatile uint8         Index;
  volatile FlsLoader_ValueType* Passwordptr;

  /* Init RetError to OK */
  RetError = FLSLOADER_E_OK ;
  Passwordptr = Password;

  #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  if (FlsLoader_InitStatus != FLSLOADER_INITIALIZED)
  {
    /*  Report missing initialization to DET */
    Det_ReportError(FLSLOADER_MODULE_ID,
                    FLSLOADER_INSTANCE_ID,
                    FLSLOADER_SID_UNLOCK,
                    FLSLOADER_E_UNINIT);
    RetError = FLSLOADER_E_NOT_OK;
  }
  else
  {
    /*IFX_MISRA_RULE_01_02_STATUS=TargetAddress is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
    if (TargetAddress != FLSLOADER_UCB_PFLASH)
    {
    /*IFX_MISRA_RULE_01_02_STATUS=TargetAddress is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
      if (TargetAddress != FLSLOADER_UCB_DFLASH)
      {
        Det_ReportError(
                   FLSLOADER_MODULE_ID,
                   FLSLOADER_INSTANCE_ID,
                   FLSLOADER_SID_UNLOCK,
                   FLSLOADER_E_PARAM_ADDRESS);
        RetError = FLSLOADER_E_NOT_OK;
      }
    }
  }
  #endif
  /* #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON) */

  /* PROTECTION in PFLASH  */
  /*IFX_MISRA_RULE_01_02_STATUS=TargetAddress is defined of type 
  volatile uint32 to avoid compiler optimization in command cycles*/
  if ( TargetAddress == FLSLOADER_UCB_PFLASH )
  {
    /* PROTECTION in PFLASH  */
    UserConfig = FLSLOADER_UCB0;
  }
  else
  {
    /* PROTECTION in DFLASH  */
    UserConfig = FLSLOADER_UCB1;
  }
  /* Start address for the command cycle */
  StartAddress = FLSLOADER_DFLASH0_START_ADDRESS;
  #ifdef IFX_FLSLOADER_DEBUG
  FlsBusyStat = TestFlsloader_DebugMask01;
  #else
  FlsBusyStat = (uint32)(FLASH0_FSR.U & (uint32)FLSLOADER_FLASH_BUSY_MASK);
  #endif  /*#ifdef IFX_FLSLOADER_DEBUG*/

  if (FlsBusyStat != 0U)
  {
    /* Report Pflash busy to DET */
    #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
    Det_ReportError(
                    FLSLOADER_MODULE_ID,
                    FLSLOADER_INSTANCE_ID,
                    FLSLOADER_SID_UNLOCK,
             (uint8)FLSLOADER_E_BUSY);
    #endif
    RetError = FLSLOADER_E_BUSY;
  }
  if (RetError == FLSLOADER_E_OK)
  {
    /* cycle 1 */
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
    volatile uint32 to avoid compiler optimization in command cycles*/
    /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
    address comparison/calculation purpose.*/
    /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
    address comparison/calculation purpose.*/
    *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_553C(StartAddress))  = 
                                                              UserConfig;
    /* Cycle 2 to Cycle 9 : Passwords for disabling protection */
    for(Index =(uint8)0U; Index < FLSLOADER_PWD; Index++)
    {
      /* provide 8 passwords */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
      volatile uint32 to avoid compiler optimization in command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
      address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
      address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
      access the Address and is within allowed range*/
      *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_553C(StartAddress))  = 
                                                         Passwordptr[Index];
    }
    if (UserConfig == FLSLOADER_UCB0)
    {
      /*Check if there are no protection and sequence errors*/
      FlsErrCheck = FlsLoader_lProtSeqOperErrorCheck();
      /* Check if PFlash Protection is Disabled*/
      FlsFpro     = FLASH0_FPRO.B.PRODISP;
      /* return if protection is not disabled or if there are errors */
      if ((FlsFpro == 0U) || (FlsErrCheck == FLSLOADER_E_NOT_OK))
      {
      /* return if protection is not disabled or if there are errors */
        RetError = FLSLOADER_E_NOT_OK;
      }
    }
    else
    {
      /*Check if there are no protection and sequence errors*/
      FlsErrCheck = FlsLoader_lProtSeqOperErrorCheck();
      /* Check if DFlash Protection is Disabled*/
      FlsFprodisd = FLASH0_FPRO.B.PRODISD;
      /* return if protection is not disabled or if there are errors */
      if ((FlsFprodisd == 0U) || (FlsErrCheck == FLSLOADER_E_NOT_OK))
      {
        /* return if protection is not disabled or if there are errors */
        RetError = FLSLOADER_E_NOT_OK;
      }
    }

    if (RetError == (FlsLoader_ReturnType)FLSLOADER_E_OK)
    {
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of type 
      volatile uint32 to avoid compiler optimization in command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32 for 
      address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 for 
      address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FlsLoader_lClearStatus(StartAddress)) = 
                                                      FLSLOADER_VALUE_FA;
    }
  }
  return (RetError) ;
}
#endif  /* if (FLSLOADER_LOCK_UNLOCK_API == STD_ON)    */

