smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_FLSLOADER_PR1628]                    **
**            [/cover]                                                        **
** Syntax           :  FlsLoader_ReturnType FlsLoader_Suspend(                **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
** Service ID       : 0x06                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   : void                                                    **
**                                                                            **
** Parameters (out) : none                                                    **
**                                                                            **
** Return value     : FLSLOADER_E_OK - API excecuted succesffully             **
**                    FLSLOADER_E_NOT_OK - DET errors occured                 **
**                                                                            **
**                                                                            **
** Description      : This function is used to  suspend flash write or        **
                      erase operation.                                        **
*******************************************************************************/
FlsLoader_ReturnType FlsLoader_Suspend (void)
{
  FlsLoader_ReturnType RetError ;
  RetError = FLSLOADER_E_OK;

  #if (FLSLOADER_DEV_ERROR_DETECT == STD_ON)
  if (FlsLoader_InitStatus != FLSLOADER_INITIALIZED)
  {
    /* Report missing initialization to DET */
    Det_ReportError(
                    FLSLOADER_MODULE_ID,
                    FLSLOADER_INSTANCE_ID,
                    FLSLOADER_SID_SUSPEND,
                    FLSLOADER_E_UNINIT);
    
    RetError = FLSLOADER_E_NOT_OK;
  }
  #endif

  FlsLoader_Status = FLSLOADER_SUSPEND;
  return(RetError);
}  /*End of suspend function */

#define FLSLOADER_STOP_SEC_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
  /* Inline Functions */

#define FLSLOADER_START_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_FLSLOADER_PR1629]                    **
**            [/cover]                                                        **
** Syntax       :IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lPverCheck  (**
**                                                                            **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   :                                                         **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : value: RetError                                         **
**                                                                            **
** Description      : This function checks for Program Verify Error           **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lPverCheck(void)
{
  volatile uint32 FlsPeverErr ;
  FlsLoader_ReturnType  RetError;

  RetError = FLSLOADER_E_OK;

  #ifdef  IFX_FLSLOADER_DEBUG
  FlsPeverErr = (FLASH0_FSR.U & FLSLOADER_PVER_ERROR)||
                 TestFlsloader_DebugMask06;
  #else
  FlsPeverErr = (uint32)(FLASH0_FSR.U & FLSLOADER_PVER_ERROR);
  #endif
  
  if (FlsPeverErr)
  {
    RetError = FLSLOADER_E_NOT_OK;
  }
  return (RetError);
}
/*******************************************************************************
** Syntax          :IFX_LOCAL_INLINE FlsLoader_ReturnType                     **
**                                  FlsLoader_lEverCheck(void)                **
**                                                                            **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : non - reentrant                                         **
**                                                                            **
** Parameters(in)   :                                                         **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : value: RetError                                         **
**                                                                            **
** Description      : This function checks for Erase Verify Error             **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lEverCheck(void)
{
  volatile uint32 FlsEverError;
  FlsLoader_ReturnType  RetError;

