smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
  RetError = FLSLOADER_E_OK;
  #ifdef  IFX_FLSLOADER_DEBUG
  FlsEverError = TestFlsloader_DebugMask09;
  #else
  FlsEverError = (uint32)(FLASH0_FSR.U & FLSLOADER_EVER_ERROR);
  #endif
  
  if (FlsEverError)
  {
    RetError = FLSLOADER_E_NOT_OK;
  }
  return (RetError);
}
/*******************************************************************************
** Syntax           : uint32 FlsLoader_lDisableInts                           **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : reentrant                                               **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) :                                                         **
** Return value     : uint32                                                  **
**                                                                            **
** Description      : This function disables the global interrupt flag.       **
**                                                                            **
*******************************************************************************/
uint32 FlsLoader_lDisableInts(void)
{
  uint32 Icr;
  /* read interrupt control register */
  ISYNC(); /* execute isync */
  Icr = (uint32)MFCR(CPU_ICR);
  DISABLE();
  return (Icr);

}
/*******************************************************************************
** Syntax           : void FlsLoader_lEnableInts                              **
**                    (                                                       **
**                      uint32 Icr                                            **
**                    )                                                       **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : reentrant                                               **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) :                                                         **
** Return value     : uint32                                                  **
**                                                                            **
** Description      : This function restores the global interrupt flag.       **
**                                                                            **
*******************************************************************************/
void FlsLoader_lEnableInts(uint32 Icr)
{
  #ifdef IFX_FLSLOADER_DEBUG
  Icr = TestFlsloader_DebugMask05;
  #endif/*#ifdef IFX_FLSLOADER_DEBUG*/
  if ((uint32)Icr & ((uint32)1U << (uint32)FLSLOADER_SHIFT_BY_15))
  {
  /* interrupts were enabled, enable again */
    ENABLE();
  }

}
/*******************************************************************************
** Syntax           : void FlsLoader_lResetSafetyENDINIT                      **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : reentrant                                               **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) :                                                         **
** Return value     : void                                                    **
**                                                                            **
** Description      : This function resets the safety end init flag.          **
** When FLsLoader driver is executing write or erase, it is assumed that      **
** there are no other tasks running in parallel or from another core that     **
** requires the service of safety WDG endinit function.                       **
** Password sequencing will not be enabled and not checked within this        **
** function, also Time based check is not enabled                             **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE void FlsLoader_lResetSafetyENDINIT(void)
{
  uint32 NewValCon0;
  uint32 NewPw;                   /* next password to be used */
  uint32 NewRel;                  /* next reload value to be used */
 
  uint32 Result;
  
  /* Safety Wdg register is acquired */
  volatile Ifx_SCU_WDTS_CON0* ScuWdtcon0Ptr 
                              = &SCU_WDTS_CON0;
  /* save old value */
  NewValCon0  = SCU_WDTS_CON0.U;
  /* get valid next password */

