smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
  Result = NewValCon0 & FLSLOADER_WDT_PASSWORD_MASK;
  Result = ( Result & FLSLOADER_WDT_PASSWORD_UPPER_MASK) |
             ((~(Result & FLSLOADER_WDT_PASSWORD_LOWER_MASK)) 
             & FLSLOADER_WDT_PASSWORD_LOWER_MASK );

  /* password sequencing will not be enabled at this time,
  no need for the run time calculation of password */
  NewPw = Result;
  /* get valid next timer reload */
  Result = NewValCon0 & FLSLOADER_WDT_RELOAD_MASK;
  /* Time control enable shall not be enabled by the system */
  NewRel= Result;
  /* build required password WDTCON0 value */
  NewValCon0 =  ( (NewRel) |              /* new reload value  */
                  (NewPw)  |              /* new Password */
                  (1u) );                 /* Clear LCK, keep ENDINIT set */

  ScuWdtcon0Ptr->U  = NewValCon0;        /* password access to unlock */

  NewValCon0 &= ~ FLSLOADER_WDT_STATUS_MASK;/*clear ENDINIT and LCK Bit */
  NewValCon0 |= FLSLOADER_NUM_2;                    /* set LCK Bit */

  ScuWdtcon0Ptr->U = NewValCon0;  /* write access and lock for Timeout mode */
}

/*******************************************************************************
** Syntax           : void FlsLoader_lSetSafetyENDINIT                        **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : reentrant                                               **
**                                                                            **
** Parameters (in)  : none                                                    **
**                                                                            **
** Parameters (out) :                                                         **
** Return value     : void                                                    **
**                                                                            **
** Description      : This function sets  the safety end init flag.           **
** When FLsLoader driver is executing write or erase, it is assumed that      **
** there are no other tasks running in parallel or from another core that     **
** requires the service of safety WDG endinit function.                       **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE void FlsLoader_lSetSafetyENDINIT(void)
{
  uint32 NewValCon0;
  uint32 NewPw;                   /* next password to be used */
  uint32 NewRel;                  /* next timer reload to be used */
  uint32 Result;

  volatile Ifx_SCU_WDTS_CON0* ScuWdtcon0Ptr 
                                  = &SCU_WDTS_CON0;
  /* save old value */
  NewValCon0  =SCU_WDTS_CON0.U;

  Result = NewValCon0 & FLSLOADER_WDT_PASSWORD_MASK;
  Result = ( Result & FLSLOADER_WDT_PASSWORD_UPPER_MASK) |
             ((~(Result & FLSLOADER_WDT_PASSWORD_LOWER_MASK)) 
             & FLSLOADER_WDT_PASSWORD_LOWER_MASK );
  NewPw = Result;

  Result = NewValCon0 & FLSLOADER_WDT_RELOAD_MASK;
  NewRel= Result;
  /* build required password WDTCON0 value */
  NewValCon0  =  ( (NewRel) |             /* new reload value  */
                  (NewPw)   |             /* new Password */
                  (1u) );                 /* Clear LCK, keep ENDINIT set */
  SCU_WDTS_CON0.U   = NewValCon0;         /*  unlock with password access */
  /* clear timer reload and restore saved and corrected reload value */
  NewValCon0 &= ~FLSLOADER_WDT_STATUS_MASK;/* clear ENDINIT and LCK Bit*/
  NewValCon0 |= FLSLOADER_NUM_3;         /* set LCK and ENDINIT Bit */
  ScuWdtcon0Ptr->U = NewValCon0;         /* write modify access and lock */

}


/*******************************************************************************
** Syntax           :  void FlsLoader_lBurstWrite (uint32 BurstLoadPageCount, **
**                          FlsLoader_AddressType BurstOffSet,                **
**                          uint32 FlashType,                                 **
**                          const uint8 *SourceAddressPtr,                    **
**                          FlsLoader_AddressType TargetAddress,              **
**                          uint32 NumberOfBursts);                           **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : reentrant                                               **
**                                                                            **
** Parameters (in)  : BurstLoadPageCount,                                     **
**                    BurstOffSet,                                            **
**                    FlashType,                                              **
**                    PdataPtr,                                               **
**                    TargetAddress                                           **
**                                                                            **
** Parameters (out) :                                                         **
**                                                                            **
** Return value     : FLSLOADER_E_OK                                          **
**                    FLSLOADER_E_NOT_OK                                      **
**                                                                            **
** Description      :                                                         **
**                                                                            **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lBurstWrite (
                            uint32 BurstLoadPageCount,
                            FlsLoader_AddressType BurstOffSet,
                            uint32 FlashType,
                            const uint8 *SourceAddressPtr,
                            FlsLoader_AddressType TargetAddress,
                            uint32 NumberOfBursts)
{
  volatile uint32                FlashBusyStat;
  volatile uint32                BusyCheck;
  FlsLoader_AddressType         *PdataPtr;
  FlsLoader_AddressType         *LoadPageAddress;
  FlsLoader_ReturnType           RetError;
  FlsLoader_AddressType          StartAddress;
  uint32                         InCount;
  uint32                         Count;
  

  StartAddress = FLSLOADER_CMD_BASE;
  RetError = FLSLOADER_E_OK;
  /*IFX_MISRA_RULE_11_05_STATUS="PdataPtr" attempt to cast away
  volatile in terms of pointer access*/
  PdataPtr = (FlsLoader_AddressType *)(void *)(SourceAddressPtr);
 
  for (Count = 0U; 
      (Count < NumberOfBursts) && (RetError == FLSLOADER_E_OK); 
       Count++)
  {
    if (FlashType != FLSLOADER_DFLASH_BANK0)
    {
      FlsLoader_lResetSafetyENDINIT();
    }
    /* Enter the Page Mode */
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is 
    defined of type volatile uint32 to avoid compiler 
    optimization in command cycles*/
    /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast 
    to uint32 for address comparison/calculation purpose.*/
    /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast 
    to uint32 for address comparison/calculation purpose.*/
    *((FlsLoader_AddressType*)FlsLoader_lEnterPageMode(
                              StartAddress)) =
                              FlsLoader_lGetMode(FlashType);
    DSYNC();
    InCount = 0U;
    /* Check if Program Flash is in page mode */
    if (FlashType != FLSLOADER_DFLASH_BANK0)
    {
      #ifdef  IFX_FLSLOADER_DEBUG
      FlashBusyStat = TestFlsloader_DebugMask04;
      #else
      FlashBusyStat = FLASH0_FSR.B.PFPAGE;
      #endif
      while((FlashBusyStat != FLSLOADER_BIT_SET) &&
           (InCount < FLSLOADER_CMDCYCLE_TIMEOUT))
      {
        InCount++;
        #ifdef  IFX_FLSLOADER_DEBUG
        FlashBusyStat = TestFlsloader_DebugMask04;
        #else
        FlashBusyStat = FLASH0_FSR.B.PFPAGE;
        #endif
      }
    }
    else
    {
      #ifdef  IFX_FLSLOADER_DEBUG
      FlashBusyStat = TestFlsloader_DebugMask04;
      #else
      FlashBusyStat = FLASH0_FSR.B.DFPAGE;
      #endif
      while ((FlashBusyStat != FLSLOADER_BIT_SET) &&
             (InCount < FLSLOADER_CMDCYCLE_TIMEOUT))
      {
        InCount++;
        #ifdef  IFX_FLSLOADER_DEBUG
        FlashBusyStat = TestFlsloader_DebugMask04;
        #else
        FlashBusyStat = FLASH0_FSR.B.DFPAGE;
        #endif
      }
    }

