smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_CD_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/flsloader_infineon_tricore/ssc/src/FlsLoader.c
/*******************************************************************************
**FlsLoader_ReturnType FlsLoader_lPageWrite (uint32 LoadPageCount,            **
**                           FlsLoader_AddressType OffSet,                    **
**                           uint32 FlashType,                                **
**                           const uint8 *SourceAddressPtr,                   **
**                           FlsLoader_AddressType TargetAddress,             **
**                           uint32 NoOfPages);                               **
**                                                                            **
** Service ID       :   NA                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : reentrant                                               **
**                                                                            **
** Parameters (in)  :  LoadPageCount,                                         **
**                     OffSet,                                                **
**                     FlashType,                                             **
**                     SourceAddressPtr,                                      **
**                     TargetAddress                                          **
**                                                                            **
** Parameters (out) :                                                         **
**                                                                            **
** Return value     : FLSLOADER_E_OK                                          **
**                    FLSLOADER_E_NOT_OK                                      **
**                                                                            **
** Description      :                                                         **
**                                                                            **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE FlsLoader_ReturnType FlsLoader_lPageWrite (
                           uint32 LoadPageCount,
                           FlsLoader_AddressType OffSet,
                           uint32 FlashType,
                           const uint8 *SourceAddressPtr,
                           FlsLoader_AddressType TargetAddress,
                           uint32 NoOfPages)
{
  volatile uint32                FlashBusyStat;
  volatile uint32                BusyCheck;
  uint32                         InCount;
  uint32                         Count;
  FlsLoader_ReturnType           RetError;
  FlsLoader_AddressType          StartAddress;
  FlsLoader_AddressType         *PdataPtr;
  FlsLoader_AddressType         *LoadPageAddress;
  
  
  StartAddress = FLSLOADER_CMD_BASE;
  RetError = FLSLOADER_E_OK;
  /*IFX_MISRA_RULE_11_05_STATUS="PdataPtr" attempt to cast away
  volatile in terms of pointer access*/
  PdataPtr = (FlsLoader_AddressType *)(void *)(SourceAddressPtr);

  for (Count = 0U; (Count < NoOfPages) && (RetError == FLSLOADER_E_OK); Count++)
  {
    if (FlashType != FLSLOADER_DFLASH_BANK0)
    {
      FlsLoader_lResetSafetyENDINIT();
    }
    /* Enter the Page Mode */
    /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined of 
    type volatile uint32 to avoid compiler optimization in 
    command cycles*/
    /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to uint32
    for address comparison/calculation purpose.*/
    /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to uint32 
    for address comparison/calculation purpose.*/
    *((FlsLoader_AddressType*)FlsLoader_lEnterPageMode(StartAddress)) =
                                       FlsLoader_lGetMode(FlashType);
    DSYNC();
    InCount = 0U;
    /*Check if Program Flash is in page mode */
    if (FlashType != FLSLOADER_DFLASH_BANK0)
    {
      #ifdef  IFX_FLSLOADER_DEBUG
      FlashBusyStat = TestFlsloader_DebugMask04;
      #else
      FlashBusyStat = FLASH0_FSR.B.PFPAGE;
      #endif
      while((FlashBusyStat != FLSLOADER_BIT_SET) &&
            (InCount < FLSLOADER_CMDCYCLE_TIMEOUT))
      {
        InCount++;
        #ifdef  IFX_FLSLOADER_DEBUG
        FlashBusyStat = TestFlsloader_DebugMask04;
        #else
        FlashBusyStat = FLASH0_FSR.B.PFPAGE;
        #endif
      }
    }
    else
    {
      #ifdef  IFX_FLSLOADER_DEBUG
      FlashBusyStat = TestFlsloader_DebugMask04;
      #else
      FlashBusyStat = FLASH0_FSR.B.DFPAGE;
      #endif
      while((FlashBusyStat != FLSLOADER_BIT_SET) &&
           (InCount < FLSLOADER_CMDCYCLE_TIMEOUT))
      {
        InCount++;
        #ifdef  IFX_FLSLOADER_DEBUG
        FlashBusyStat = TestFlsloader_DebugMask04;
        #else
        FlashBusyStat = FLASH0_FSR.B.DFPAGE;
        #endif
      }
    }

    /* Check PFPAGE/DFPAGE bit was SET */
    if(InCount < FLSLOADER_CMDCYCLE_TIMEOUT)
    {
      for (InCount=0U; InCount < LoadPageCount; InCount++)
      {
        /* Load the data */
        /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is 
        defined of type volatile uint32 to avoid compiler 
        optimization in command cycles*/
        /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to 
        uint32 for address comparison/calculation purpose.*/
        /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to 
        uint32 for address comparison/calculation purpose.*/
        LoadPageAddress = 
                (FlsLoader_AddressType *)FlsLoader_lLoadPage(StartAddress);

        *LoadPageAddress = *PdataPtr;
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used to load 
        data into address and is within allowed range*/
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used to load 
        data into address and is within allowed range*/
        *(LoadPageAddress + 1U) = *(PdataPtr + 1U);
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic used to load 
        data into address and is within allowed range*/
        PdataPtr += FLSLOADER_NUM_2;
        /* Load Page register gets incremented automatically. */
      }
      /* cycle 1 */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is 
      defined of type volatile uint32 to avoid compiler 
      optimization in command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AA50(
                                     StartAddress)) = TargetAddress;
      /* cycle 2 */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined 
      of type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AA58(
                               StartAddress))=  FLSLOADER_VALUE_00;
      /* cycle 3 */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined 
      of type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AAA8(
                               StartAddress))=  FLSLOADER_VALUE_A0;
      /*cycle 4 */
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is defined 
      of type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to
      uint32 for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FLSLOADER_GET_CYCLE_AAA8(
                                StartAddress))= FLSLOADER_VALUE_AA;
      DSYNC();
      /* Wait till the PROG bit is set */
      InCount = 0U;
      #ifdef  IFX_FLSLOADER_DEBUG
      FlashBusyStat =  TestFlsloader_DebugMask06;
      #else
      FlashBusyStat = FLASH0_FSR.B.PROG;
      #endif
      
      while((FlashBusyStat != FLSLOADER_BIT_SET) &&
            (InCount < FLSLOADER_CMDCYCLE_TIMEOUT))
      {
        InCount++;
        #ifdef  IFX_FLSLOADER_DEBUG
        FlashBusyStat =  TestFlsloader_DebugMask06;
        #else
        FlashBusyStat = FLASH0_FSR.B.PROG;
        #endif
      }
      if (InCount < FLSLOADER_CMDCYCLE_TIMEOUT)
      {
        /* Check for FLASH BUSY flag */
        /* PnBUSY and D0BUSY */
        InCount = 0U;
        #ifdef  IFX_FLSLOADER_DEBUG
        BusyCheck = TestFlsloader_DebugMask02 ;
        #else
        BusyCheck = (FLASH0_FSR.U & (uint32)FLSLOADER_FLASH_BUSY_MASK);
        #endif
        while((BusyCheck != 0U) && 
              (InCount < FLSLOADER_BUSY_TIMEOUT))
        {
          InCount++;
          #ifdef  IFX_FLSLOADER_DEBUG
          BusyCheck = TestFlsloader_DebugMask02;
          #else
          BusyCheck = (FLASH0_FSR.U & (uint32)FLSLOADER_FLASH_BUSY_MASK);
          #endif
        }
        if (InCount < FLSLOADER_BUSY_TIMEOUT )
        {
          /* This check makes sure No protection error and no 
          sequence error and No operation error has occurred.*/
          RetError = FlsLoader_lProtSeqOperErrorCheck();
          if(RetError == (FlsLoader_ReturnType)FLSLOADER_E_OK)
          {
            /* This check makes sure No program verification error */
            RetError = (FlsLoader_ReturnType)FlsLoader_lPverCheck();
          }
        }
        else
        {
          RetError = FLSLOADER_E_NOT_OK;
        }
      }
      else
      {
        RetError = FLSLOADER_E_NOT_OK;
      }
      /* Clear the status if the operation is successful.*/
      /*IFX_MISRA_RULE_01_02_STATUS=FlsLoader_AddressType is 
      defined of type volatile uint32 to avoid compiler 
      optimization in command cycles*/
      /*IFX_MISRA_RULE_11_01_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      /*IFX_MISRA_RULE_11_03_STATUS= The Pointers are type-cast to 
      uint32 for address comparison/calculation purpose.*/
      *((FlsLoader_AddressType*)FlsLoader_lClearStatus(
                                StartAddress))= FLSLOADER_VALUE_FA;

      /*Iterate the TargetAddress to the next page Address */
      /*IFX_MISRA_RULE_01_02_STATUS=TargetAddress is defined of 
      type volatile uint32 to avoid compiler optimization in 
      command cycles*/
      TargetAddress = TargetAddress + OffSet;
    }
    else
    {
      RetError = FLSLOADER_E_NOT_OK;
    }
    if ((FlashType != FLSLOADER_DFLASH_BANK0))
    {
      FlsLoader_lSetSafetyENDINIT();
    }
  }
  return RetError;
}
#define FLSLOADER_STOP_SEC_WRITE_CODE
  /*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives 
  is allowed only for MemMap.h*/
#include "MemMap.h"

